Raw-wrk-files/run-3/update/phpixie/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 15:36:49 PDT 2013

  System load:  0.0                Processes:           119
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/updates?queries=2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/updates?queries=2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.85ms    4.09ms  29.41ms   66.84%
    Req/Sec    69.68     17.20   121.00     73.73%
  2790 requests in 5.02s, 23.11MB read
  Non-2xx or 3xx responses: 2790
Requests/sec:    555.86
Transfer/sec:      4.60MB

---------------------------------------------------------
 Running Warmup phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates?queries=2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates?queries=2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   310.34ms   96.50ms   1.18s    77.17%
    Req/Sec   102.60      5.46   114.00     67.21%
  12335 requests in 15.02s, 102.14MB read
  Non-2xx or 3xx responses: 12335
Requests/sec:    821.26
Transfer/sec:      6.80MB

---------------------------------------------------------
 Queries: 1 for phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates?queries=1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates?queries=1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   237.01ms  140.92ms 816.19ms   58.93%
    Req/Sec   225.50    188.09   576.00     73.44%
  26049 requests in 15.05s, 79.09MB read
  Non-2xx or 3xx responses: 9092
Requests/sec:   1730.32
Transfer/sec:      5.25MB

---------------------------------------------------------
 Queries: 5 for phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates?queries=5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates?queries=5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   232.79ms  136.92ms   1.04s    66.86%
    Req/Sec   166.60     85.46   328.00     66.22%
  19656 requests in 15.05s, 73.07MB read
  Non-2xx or 3xx responses: 8332
Requests/sec:   1306.42
Transfer/sec:      4.86MB

---------------------------------------------------------
 Queries: 10 for phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates?queries=10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates?queries=10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   309.68ms   98.26ms 997.05ms   75.05%
    Req/Sec   102.62     10.20   127.00     86.36%
  12374 requests in 15.04s, 102.46MB read
  Non-2xx or 3xx responses: 12374
Requests/sec:    822.79
Transfer/sec:      6.81MB

---------------------------------------------------------
 Queries: 15 for phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates?queries=15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates?queries=15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   309.44ms   77.39ms 655.17ms   73.82%
    Req/Sec   102.47      9.20   134.00     77.84%
  12270 requests in 15.02s, 101.60MB read
  Non-2xx or 3xx responses: 12270
Requests/sec:    816.89
Transfer/sec:      6.76MB

---------------------------------------------------------
 Queries: 20 for phpixie
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates?queries=20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates?queries=20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   301.82ms   91.67ms   1.17s    76.92%
    Req/Sec   104.61      6.78   133.00     77.62%
  12464 requests in 15.02s, 103.21MB read
  Non-2xx or 3xx responses: 12464
Requests/sec:    829.79
Transfer/sec:      6.87MB